QUESTIONS = [
    {
        "id": 1,
        "question_id": "S3",
        "text": "آپ کا جینڈر کیا ہے؟ مرد - 1، عورت - 2",
        "type": "general",
    },
    {
        "id": 2,
        "question_id": "S4",
        "text": "اپنی عمر بتائیں۔",
        "type": "general", 
    },
    {
        "id": 3,
        "question_id": "Q1",
        "text": "آپ کو ریو بسکٹ دیکھنے میں کیسا لگا؟ 1 سے 7 کے اسکیل پر بتائیں، جہاں 1 کا مطلب ہے 'بالکل بھی پسند نہیں آیا' اور 7 کا مطلب ہے 'بہت پسند آیا'۔",
        "type": "general"
    },
    {
        "id": 4,
        "question_id": "Q7a",
        "text": "برائے مہربانی بتائیں کہ آپ کو ریو  کا ذائقہ کس حد تک پسند آیا؟ 1 سے 7 کے اسکیل پر جہاں 1 کا مطلب ہے بالکل بھی پسند نہیں آیا اور 7 کا مطلب ہے بہت پسند آیا۔",
        "type": "general"
    },
    {
        "id": 5,
        "question_id": "Q6a",
        "text": "مجموعی طور پر آپ کو ریو  کیسا لگا؟ 1 سے 9 کے اسکیل پر بتائیں، جہاں 1 کا مطلب ہے 'بالکل بھی پسند نہیں آیا' اور 9 کا مطلب ہے 'بہت پسند آیا'۔",
        "type": "follow-up"
    },
    {
        "id": 6,
        "question_id": "Q6b",
        "text": "آپ کے جواب سے لگتا ہے آپ کو ریو  نہیں پسند آیا۔ برائے مہربانی تفصیل سے بتائیں کیوں پسند نہیں آیا؟",
        "type": "general"
    },
    {
        "id": 7,
        "question_id": "Q13",
        "text": "اب میں آپ سے آخری بار جو بسکٹ کھایا، اس کی قیمت کے حوالے سے چند سوال پوچھوں گا۔ اگر یہ پروڈکٹ 2 بسکٹ کے پیکٹ میں 30 روپے میں دستیاب ہو، تو کیا آپ اسے خریدیں گے؟ جی ہاں خریدوں گا/گی — 1، نہیں خریدوں گا/گی — 2، شاید / کچھ کہ نہیں سکتا — 3",
        "type": "general"
    },
    {
        "id": 8,
        "question_id":"a",
        "text": "کیا آپ ریو  کے بارے میں کچھ اور کہنا چاہیں گے یا کوئی مشورہ دینا چاہیں گے؟",
        "type": "general"
    }
]


# QUESTIONS = [
#     # Screening Questions (10)
#     {
#         "id": 1,
#         "question_id": "S3",
#         "text": "آپ کا جینڈر کیا ہے؟ مرد — 1، عورت — 2",
#         "type": "screening",
#         "question_type": "general"
#     },
#     {
#         "id": 2,
#         "question_id": "S4",
#         "text": "اپنی عمر بتائیں۔",
#         "type": "screening", 
#         "question_type": "general"
#     },
#     # {
#     #     "id": 3,
#     #     "question_id": "S9",
#     #     "text": "برائے مہربانی یہ بتائیے کہ آپ کے گھرانے کے معاشی سربراہ نے کہاں تک تعلیم حاصل کی؟",
#     #     "type": "screening"
#     # },
#     # {
#     #     "id": 4,
#     #     "question_id": "S10",
#     #     "text": "برائے مہربانی یہ بتائیے کہ آپ کے گھرانے کے سربراہ کا پیشہ کیا ہے؟",
#     #     "type": "screening"
#     # },
#     # {
#     #     "id": 5,
#     #     "question_id": "S5",
#     #     "text": "براہِ مہربانی یہ بتائیں کہ آپ زیادہ تر کس طرح کے بسکٹ کھاتے/کھاتی ہیں؟ سینڈوچ بسکٹ، سادہ بسکٹ، نمکین بسکٹ، یا کوئی اور؟",
#     #     "type": "screening", 
#     #     "question_type": "follow-up"
#     # },
#     # {
#     #     "id": 6,
#     #     "question_id": "S6",
#     #     "text": "براہِ مہربانی یہ بتائیں کہ آپ Sandwich Biscuit کس کثرت سے کھاتے/کھاتی ہیں؟ ہفتے میں 1 یا اس سے زیادہ، مہینے میں 2 سے 3 دفعہ، اس سے بھی زیادہ عرصے میں، یا نہیں کھاتا/کھاتی؟",
#     #     "type": "screening"
#     # },
#     # {
#     #     "id": 7,
#     #     "question_id": "S7",
#     #     "text": "براہِ مہربانی یہ بتائیں کہ آپ نے کن کن برانڈز کے Sandwich Biscuit کھائے ہیں؟ اکلیپس بسکٹ، پرنس بسکٹ، ریو بسکٹ، لیمن سینڈوچ یا چاکلیٹ سینڈوچ، یا دیگر؟",
#     #     "type": "screening"
#     # },
#     # {
#     #     "question_id": "S8",
#     #     "text": "براہِ مہربانی یہ بتائیں کہ آپ نے پچھلے 3 مہینے میں ریو (Rio) بسکٹ کھایا ہے؟ تقریباً 3–4 مہینے سے پہلے کھاتے تھے، جی ہاں کھاتے ہیں، یا نہیں کھایا کبھی؟",
#     #     "type": "screening",
#     #     "question_type": "follow-up"
#     # },
#     # {
#     #     "question_id": "S8a",
#     #     "text": "اگر آپ نے اکلیپس (Eclipse) بسکٹ نہیں کھایا تو، براہِ مہربانی بتائیں کہ آپ نے اس کے متبادل میں کون سا بسکٹ برانڈ اپنایا؟",
#     #     "type": "screening"
#     # },
#     # {
#     #     "question_id": "S8b",
#     #     "text": "اگر آپ Eclipse بسکٹ نہیں کھاتے اور کسی دوسرے برانڈ کا انتخاب کیا ہے تو، براہِ مہربانی بتائیں کہ آپ اس برانڈ کو کیوں استعمال کرتے ہیں؟",
#     #     "type": "screening"
#     # },
#     # Main Questions (14)
#     {
#         "question_id": "Q1",
#         "text": "آپ کو ریو (Rio) بسکٹ دیکھنے میں کیسا لگا؟ 1 سے 7 کے اسکیل پر بتائیں، جہاں 1 کا مطلب ہے 'بالکل بھی پسند نہیں آیا' اور 7 کا مطلب ہے 'بہت پسند آیا'۔",
#         "type": "main"
#     },
#     {
#         "question_id": "Q4b",
#         "text": "آپ کو ریو (Rio) کا رنگ کیسا لگا؟ 1 سے 5 کے اسکیل پر بتائیں، جہاں 1 کا مطلب ہے 'میری پسند سے بہت ہلکا' اور 5 کا مطلب ہے 'میری پسند سے بہت گہرا'۔",
#         "type": "main"
#     },
#     {
#         "question_id": "Q5b",
#         "text": "برائے مہربانی بتائیں کہ آپ نے آخری بار جو بسکٹ کھایا، اس کا سائز آپ کی پسند کے مطابق کیسا تھا؟ 1 کا مطلب ہے میری پسند سے بہت چھوٹا، اور 5 کا مطلب ہے میری پسند سے بہت بڑا۔",
#         "type": "main"
#     },
#     {
#         "question_id": "Q6a",
#         "text": "مجموعی طور پر آپ کو ریو (Rio) کیسا لگا؟ 1 سے 9 کے اسکیل پر بتائیں، جہاں 1 کا مطلب ہے 'بالکل بھی پسند نہیں آیا' اور 9 کا مطلب ہے 'بہت پسند آیا'۔",
#         "type": "main"
#     },
#     {
#         "question_id": "Q6b",
#         "text": "آپ کے جواب سے لگتا ہے آپ کو ریو (Rio) نہیں پسند آیا۔ برائے مہربانی تفصیل سے بتائیں کیوں پسند نہیں آیا؟",
#         "type": "main"
#     },
#     # {
#     #     "question_id": "Q7a",
#     #     "text": "برائے مہربانی بتائیں کہ آپ نے آخری بار جو بسکٹ کھایا، اس کا ذائقہ آپ کو کس حد تک پسند آیا؟ 1 سے 7 کے اسکیل پر۔ جہاں 1 کا مطلب ہے بالکل بھی پسند نہیں آیا اور 7 کا مطلب ہے بہت پسند آیا۔",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q7b",
#     #     "text": "اگر آپ نے محسوس کیا کہ ذائقہ پسند نہیں آیا تو، براہِ مہربانی بتائیں کہ کیوں؟ تفصیل سے بیان کریں۔",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q9b",
#     #     "text": "برائے مہربانی بتائیں کہ آپ نے آخری بار جو بسکٹ کھایا، اس کی مٹھاس آپ کی پسند کے مطابق کیسی تھی؟ 1 کا مطلب ہے میری پسند سے بہت کم، اور 5 کا مطلب ہے میری پسند سے بہت زیادہ۔",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q10b",
#     #     "text": "برائے مہربانی بتائیں کہ آپ نے آخری بار جو بسکٹ کھایا، اس کی خستگی آپ کی پسند کے مطابق کیسی تھی؟ 1 کا مطلب ہے میری پسند سے بہت کم خستہ، اور 5 کا مطلب ہے میری پسند سے بہت زیادہ خستہ۔",
#     #     "type": "main"
#     # },
#     {
#         "question_id": "Q13",
#         "text": "اب میں آپ سے آخری بار جو بسکٹ کھایا، اس کی قیمت کے حوالے سے چند سوال پوچھوں گا۔ اگر یہ پروڈکٹ 2 بسکٹ کے پیکٹ میں 30 روپے میں دستیاب ہو، تو کیا آپ اسے خریدیں گے؟ جی ہاں خریدوں گا/گی — 1، نہیں خریدوں گا/گی — 2، شاید / کچھ کہ نہیں سکتا — 3",
#         "type": "main"
#     },
#     {
#         "question_id":"a",
#         "text": "کیا آپ ریو (Rio) کے بارے میں کچھ اور کہنا چاہیں گے یا کوئی مشورہ دینا چاہیں گے؟",
#         "type": "main"
#     }
#     # {
#     #     "question_id": "Q15",
#     #     "text": "یہ پیکیجنگ دیکھ کر کیا لگ رہا ہے کہ یہ کس چیز کی پیکیجنگ ہے؟ یہ کسی بسکٹ برانڈ کی پیکیجنگ لگ رہی ہے — 1، یہ کسی کیک برانڈ کی پیکیجنگ لگ رہی ہے — 2، یہ کسی چاکلیٹ بار کی پیکیجنگ لگ رہی ہے — 3، یہ کسی سویٹس / کنفیکشنری آئٹم کی پیکیجنگ لگ رہی ہے — 4، سمجھ نہیں آ رہا کہ کس چیز کی پیکیجنگ ہے — 5، یا دیگر — 6",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q15a",
#     #     "text": "اگر آپ نے کہا کہ یہ بسکٹ برانڈ کی پیکیجنگ نہیں لگ رہی، تو ہم اس میں کیا بہتر کریں تاکہ یہ بسکٹ برانڈ کی پیکیجنگ لگے؟ رنگ زیادہ دلکش / نمایاں کیے جا سکتے ہیں — 1، بسکٹ کی تصویر واضح یا بڑی ہو سکتی ہے — 2، ڈیزائن میں تبدیلی یا pattern بڑھایا جا سکتا ہے — 3، برانڈ کا نام یا لوگو زیادہ نمایاں ہونا چاہیے — 4، پیکنگ پر flavour یا type واضح لکھا ہونا چاہیے — 5، کچھ بھی بہتر کرنے کی ضرورت نہیں — 6، یا دیگر — 7",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q15b",
#     #     "text": "اگر آپ نے کہا کہ یہ بسکٹ برانڈ کی پیکیجنگ لگ رہی ہے، تو براہِ مہربانی بتائیں کہ کس قسم کے بسکٹ کی پیکیجنگ لگ رہی ہے؟",
#     #     "type": "main"
#     # },
#     # {
#     #     "question_id": "Q17",
#     #     "text": "ان دونوں میں سے کون سی پیکیجنگ آپ کے بسکٹ خریدنے کے فیصلے پر زیادہ اثر انداز ہوتی ہے؟ اور کیوں؟",
#     #     "type": "main"
#     # }
# ]

